<a href="https://colab.research.google.com/github/lauvsong/data-analysis-practice/blob/main/pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
a = pd.Series([1,2,3])
a

0    1
1    2
2    3
dtype: int64

In [2]:
a.index

RangeIndex(start=0, stop=3, step=1)

In [3]:
a.values

array([1, 2, 3])

In [4]:
a.index = ['a', 'b', 'c']
a

a    1
b    2
c    3
dtype: int64

In [5]:
b = pd.Series([1,2,3,4], index=['a','b','c','d'])
b

a    1
b    2
c    3
d    4
dtype: int64

In [8]:
b['b'] = 2017
b['e'] = 2019
b

a       1
b    2017
c       3
d       4
e    2019
dtype: int64

In [9]:
b[b>3]

b    2017
d       4
e    2019
dtype: int64

In [10]:
b*2

a       2
b    4034
c       6
d       8
e    4038
dtype: int64

In [11]:
dict_data = {
    'name': 'Choi',
    'age':30,
    'hobby': ['study', 'swimming'],
    'gender': 'man',
    'weak point': None
}
sr_data = pd.Series(dict_data)
sr_data

name                       Choi
age                          30
hobby         [study, swimming]
gender                      man
weak point                 None
dtype: object

In [13]:
sr_data.isnull()

name          False
age           False
hobby         False
gender        False
weak point     True
dtype: bool

In [14]:
sr_data.index.name = 'label'
sr_data.name = "Personal Information"
sr_data

label
name                       Choi
age                          30
hobby         [study, swimming]
gender                      man
weak point                 None
Name: Personal Information, dtype: object

In [22]:
import numpy as np

sel = pd.Series(np.arange(0,31,2))
sel

0      0
1      2
2      4
3      6
4      8
5     10
6     12
7     14
8     16
9     18
10    20
11    22
12    24
13    26
14    28
15    30
dtype: int64

In [23]:
sel.index = sel.values
sel

0      0
2      2
4      4
6      6
8      8
10    10
12    12
14    14
16    16
18    18
20    20
22    22
24    24
26    26
28    28
30    30
dtype: int64

In [30]:
sel[(sel >= 4) & (sel % 4 == 0)] = None
sel

0      0.0
2      2.0
4      NaN
6      6.0
8      NaN
10    10.0
12     NaN
14    14.0
16     NaN
18    18.0
20     NaN
22    22.0
24     NaN
26    26.0
28     NaN
30    30.0
dtype: float64

In [43]:
data = {
    'id' : [1,2,3],
    'name': ['Choi', 'Lee', "Kim"],
    'age': [10,20,30],
    'assets': [150.4, 123.4, 88.88],
    'job': ['student', 'CEO', 'Dad']
}
df = pd.DataFrame(data)
df

   id  name  age  assets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [44]:
df = pd.DataFrame(data, columns = ['id', 'name', 'job', 'age', 'assets', 'hobby'],
                  index = ['one', 'two', 'three'])
df

       id  name      job  age  assets hobby
one     1  Choi  student   10  150.40   NaN
two     2   Lee      CEO   20  123.40   NaN
three   3   Kim      Dad   30   88.88   NaN

In [45]:
df.loc['one']

id              1
name         Choi
job       student
age            10
assets      150.4
hobby         NaN
Name: one, dtype: object

In [46]:
df['hobby'] = "reading books"
df

       id  name      job  age  assets          hobby
one     1  Choi  student   10  150.40  reading books
two     2   Lee      CEO   20  123.40  reading books
three   3   Kim      Dad   30   88.88  reading books

In [47]:
df['age'] = np.arange(3)
df

       id  name      job  age  assets          hobby
one     1  Choi  student    0  150.40  reading books
two     2   Lee      CEO    1  123.40  reading books
three   3   Kim      Dad    2   88.88  reading books

In [48]:
residence = pd.Series(['Seoul', 'Bucheon', 'Incheon'],
                      index = ['one', 'two', 'three'])
df['residence'] = residence
df

       id  name      job  age  assets          hobby residence
one     1  Choi  student    0  150.40  reading books     Seoul
two     2   Lee      CEO    1  123.40  reading books   Bucheon
three   3   Kim      Dad    2   88.88  reading books   Incheon

In [49]:
del df['hobby']
df

       id  name      job  age  assets residence
one     1  Choi  student    0  150.40     Seoul
two     2   Lee      CEO    1  123.40   Bucheon
three   3   Kim      Dad    2   88.88   Incheon

In [50]:
df.index = df['id']
del df['id']
df

    name      job  age  assets residence
id
1   Choi  student    0  150.40     Seoul
2    Lee      CEO    1  123.40   Bucheon
3    Kim      Dad    2   88.88   Incheon

In [51]:
df.loc[4] = ['Hong', 'FreeLancer', 60,2000,"Gangnam"]
df

    name         job  age   assets residence
id
1   Choi     student    0   150.40     Seoul
2    Lee         CEO    1   123.40   Bucheon
3    Kim         Dad    2    88.88   Incheon
4   Hong  FreeLancer   60  2000.00   Gangnam

In [52]:
df.drop(4)

    name      job  age  assets residence
id
1   Choi  student    0  150.40     Seoul
2    Lee      CEO    1  123.40   Bucheon
3    Kim      Dad    2   88.88   Incheon

In [53]:
df[['name', 'age']]

    name  age
id
1   Choi    0
2    Lee    1
3    Kim    2
4   Hong   60

In [54]:
df[2:]

    name         job  age   assets residence
id
3    Kim         Dad    2    88.88   Incheon
4   Hong  FreeLancer   60  2000.00   Gangnam

In [55]:
df.xs(3, axis=0)

name             Kim
job              Dad
age                2
assets         88.88
residence    Incheon
Name: 3, dtype: object

In [57]:
df.xs('assets', axis=1)

id
1     150.40
2     123.40
3      88.88
4    2000.00
Name: assets, dtype: float64

In [58]:
mask = [True, False, True, False]
df[mask]

    name      job  age  assets residence
id
1   Choi  student    0  150.40     Seoul
3    Kim      Dad    2   88.88   Incheon

In [59]:
df[df['age'] > 2]

    name         job  age  assets residence
id
4   Hong  FreeLancer   60  2000.0   Gangnam

In [60]:
df[df.index > 2]

    name         job  age   assets residence
id
3    Kim         Dad    2    88.88   Incheon
4   Hong  FreeLancer   60  2000.00   Gangnam

In [61]:
df.T

id               1        2        3           4
name          Choi      Lee      Kim        Hong
job        student      CEO      Dad  FreeLancer
age              0        1        2          60
assets       150.4    123.4    88.88        2000
residence    Seoul  Bucheon  Incheon     Gangnam

In [62]:
import numpy as np
import pandas as pd

se = pd.Series(range(10), index=[10,9,8,7,6,5,4,3,2,1])
se.index.name = "index"
se

index
10    0
9     1
8     2
7     3
6     4
5     5
4     6
3     7
2     8
1     9
dtype: int64

In [63]:
se = se.sort_index()
se

index
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
10    0
dtype: int64

In [64]:
se = se.sort_index(ascending=False)
se

index
10    0
9     1
8     2
7     3
6     4
5     5
4     6
3     7
2     8
1     9
dtype: int64

In [67]:
df.sort_index(ascending=False)

    name         job  age   assets residence
id
4   Hong  FreeLancer   60  2000.00   Gangnam
3    Kim         Dad    2    88.88   Incheon
2    Lee         CEO    1   123.40   Bucheon
1   Choi     student    0   150.40     Seoul

In [68]:
df.sort_index(axis=1, ascending=False)

   residence  name         job   assets  age
id
1      Seoul  Choi     student   150.40    0
2    Bucheon   Lee         CEO   123.40    1
3    Incheon   Kim         Dad    88.88    2
4    Gangnam  Hong  FreeLancer  2000.00   60

In [69]:
se.sort_values()

index
10    0
9     1
8     2
7     3
6     4
5     5
4     6
3     7
2     8
1     9
dtype: int64

In [70]:
df.sort_values(by='assets')

    name         job  age   assets residence
id
3    Kim         Dad    2    88.88   Incheon
2    Lee         CEO    1   123.40   Bucheon
1   Choi     student    0   150.40     Seoul
4   Hong  FreeLancer   60  2000.00   Gangnam

In [72]:
df['age'] = [10,20,10,30]
df.sort_values(by=['age', 'assets'])

    name         job  age   assets residence
id
3    Kim         Dad   10    88.88   Incheon
1   Choi     student   10   150.40     Seoul
2    Lee         CEO   20   123.40   Bucheon
4   Hong  FreeLancer   30  2000.00   Gangnam

In [73]:
df['age'].sum()

70

In [74]:
df['assets'].sum()

2362.68

In [75]:
df['assets'].mean()

590.67

In [76]:
df.describe()

             age       assets
count   4.000000     4.000000
mean   17.500000   590.670000
std     9.574271   939.890628
min    10.000000    88.880000
25%    10.000000   114.770000
50%    15.000000   136.900000
75%    22.500000   612.800000
max    30.000000  2000.000000

In [79]:
se = pd.Series([1,np.nan,2,np.nan,3,np.nan,4,np.nan,5])
se

0    1.0
1    NaN
2    2.0
3    NaN
4    3.0
5    NaN
6    4.0
7    NaN
8    5.0
dtype: float64

In [80]:
se.dropna()

0    1.0
2    2.0
4    3.0
6    4.0
8    5.0
dtype: float64

In [81]:
se[se.notnull()]

0    1.0
2    2.0
4    3.0
6    4.0
8    5.0
dtype: float64

In [83]:
se.fillna(0)

0    1.0
1    0.0
2    2.0
3    0.0
4    3.0
5    0.0
6    4.0
7    0.0
8    5.0
dtype: float64

In [84]:
se.fillna(se.mean())

0    1.0
1    3.0
2    2.0
3    3.0
4    3.0
5    3.0
6    4.0
7    3.0
8    5.0
dtype: float64

In [85]:
se.fillna(method='ffill')

0    1.0
1    1.0
2    2.0
3    2.0
4    3.0
5    3.0
6    4.0
7    4.0
8    5.0
dtype: float64

In [86]:
se.fillna(method='bfill')

0    1.0
1    2.0
2    2.0
3    3.0
4    3.0
5    4.0
6    4.0
7    5.0
8    5.0
dtype: float64

In [87]:
import re
p = re.compile('[a-z]+')

In [88]:
m = p.match('python')
if m:
  print('Match found: ', m.group())
else:
  print('No match')

Match found:  python

In [89]:
m = p.findall("life is too short")
print(m)

['life', 'is', 'too', 'short']

In [90]:
m = p.fullmatch("life is too short")
if m:
  print('Match found: ', m.group())
else:
  print('No match')

No match

In [91]:
m = p.fullmatch("lifeistooshort")
if m:
  print('Match found: ', m.group())
else:
  print('No match')

Match found:  lifeistooshort

In [92]:
m = re.search("^life", "life is too short")
if m:
  print('Match found: ', m.group())
else:
  print('No match')

Match found:  life

In [93]:
p = re.compile('CrowlServo')
m = p.match('CrowHello')
if m:
  print('Match found: ', m.group())
else:
  print('No match')

No match

In [95]:
p = re.compile(r'\bclass\b')
m = p.search("no class at all")
if m:
  print('Match found: ', m.group())
else:
  print('No match')

Match found:  class

In [ ]:
m = p.findall("life is too short")

In [99]:
p = re.compile(r"(\w+)\s+\d+[-]\d+[-]\d+")
m = p.search("park 010-1234-1234")
print(m.group(1))

park

In [100]:
p = re.compile(r"(?P<name>\w+)\s+\d+[-]\d+[-]\d+")
m = p.search("park 010-1234-1234")
print(m.group("name"))

park

In [101]:
p = re.compile('(blue|white|red)')
p.sub('colour', 'blue socks and red shoes')

'colour socks and colour shoes'

In [102]:
p = re.compile(r"(?P<name>\w+)\s+\d+[-]\d+[-]\d+")
print(p.sub("\g<name>", "park 010-1234-1234"))

park

In [106]:
pat = re.compile("\d{6}[-]\d{7}")

In [111]:
data = """
park 800905-1049118
kim 700905-1059119
"""

pat = re.compile("(\d{6})[-](\d{7})")
print(pat.sub("\g<1>-*******", data))

park 800905-*******
kim 700905-*******